Revit 2024 API
BoundaryConditionsOrientTo Enumeration
 Specifies boundary condition orientation.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Since: 2015
Syntax
C#
public enum BoundaryConditionsOrientTo
Visual Basic
Public Enumeration BoundaryConditionsOrientTo
Visual C++
public enum class BoundaryConditionsOrientTo
Members
Member name | Description
Project |  Boundary condition is oriented in respect to project global coordinate system, that is X to East, Y to North, and Z to up.
HostLocalCoordinateSystem |  Boundary condition is oriented in respect to it analytical host element coordinate system and will follow host changes.
See Also
Autodesk.Revit.DB.Structure Namespace